[
  {
    "title": "Event ID 4662",
    "product": "MDI",
    "lines": [
      "The increase in Event ID 4662 logs you're seeing is expected—it’s tied to enabling the Directory Service Access audit policy as part of Advanced Audit Configuration.",
      "These events aren’t generated by Microsoft Defender for Identity (MDI) itself. They originate from Windows auditing when Active Directory objects are accessed. Once this policy is enabled, the system begins logging those operations in more detail, which naturally increases the volume of 4662 events.",
      "MDI relies on this audit data to identify threats such as lateral movement, privilege escalation, and other advanced attack patterns. So, while the spike in logs may be noticeable, it reflects increased visibility and enhances the detection capabilities of Defender for Identity.",
      "There aren’t any configurable settings within Defender for Identity to reduce or control the volume of these events. The logging is driven by Windows audit policy once Directory Service Access is enabled.",
      "Below are some helpful resources related to audit configuration and required Windows events for MDI:",
      "Configure audit policies for Windows event logs - Microsoft Defender for Identity | Microsoft Learn",
      "Event collection overview - Microsoft Defender for Identity | Microsoft Learn",
      "4662(S, F) An operation was performed on an object. - Windows 10 | Microsoft Learn"
    ],
    "submittedBy": "Shalonda",
    "timestamp": "2025-08-29T22:31:57.630Z"
  },
  {
    "title": "Creating a DSA",
    "product": "MDI",
    "lines": [
      "Create a Test Service Account",
      "New-ADUser -Name \"DSA_Test_Account\" -SamAccountName \"DSA_Test_Account\" -AccountPassword (ConvertTo-SecureString \"    \" -AsPlainText -Force) -Enabled $true",
      "Confirm account exists and enabled",
      "Get-ADUser -Identity DSA_Test_Account | Select-Object Name, Enabled, SID",
      "Validate Replication (Optional but Recommended)",
      "repadmin /replsummary"
    ],
    "submittedBy": "Shalonda",
    "timestamp": "2025-08-29T22:36:40.279Z"
  },
  {
    "title": "\"Understanding Defender for Identity Sensor Version and Health Status\"",
    "product": "MDI",
    "lines": [
      "🔍 Version Discrepancy: Portal vs. Programs and Features",
      "Programs and Features",
      "• Displays the version of the original MSI installer used to deploy the sensor.",
      "• Does not update dynamically after automatic sensor upgrades.",
      "Defender for Identity Portal",
      "• Shows the live sensor version currently running and reporting to the cloud.",
      "• Is the authoritative source for sensor version and update status.",
      "✅ If the portal shows the sensor as “Up to date,” the correct version is running — even if Programs and Features shows an older build.",
      "⚠️ Sensor Health ≠ Sensor Version",
      "A sensor can be:",
      "• ✅ Up to date (latest version installed)",
      "• ❌ Unhealthy (due to service failures, missing event logs, or connectivity issues)",
      "Uninstalling and reinstalling the sensor will not resolve health issues unless the underlying cause is addressed.",
      "🛠️ How to Resolve Unhealthy Sensor Status",
      "1. Open the Defender for Identity portal.",
      "2. Click into each affected sensor.",
      "3. Review the Open Health Issues panel.",
      "4. Follow the specific recommendations provided (e.g., restart services, adjust audit policies, fix connectivity).",
      "⏳ It may take several hours for the portal to reflect updated health status after remediation.",
      "🔁 Optional: Align Displayed Version via Reinstall",
      "If you want the version shown in Programs and Features to match the live sensor version:",
      "Uninstall Steps",
      "• Open Programs and Features",
      "• Locate Azure Advanced Threat Protection Sensor",
      "• Right-click and select Uninstall",
      "Reinstall Steps",
      "• Download the latest MSI from the Defender portal",
      "• Run the installer on the same domain controller",
      "Reuse the existing workspace key if the domain controller is still listed in the portal"
    ],
    "submittedBy": "Shalonda",
    "timestamp": "2025-09-02T23:11:47.892Z"
  },
  {
    "id": "aeed2718-e0b2-4a48-a4b8-9a342107844b",
    "title": "HoneyToken",
    "product": "MDI",
    "lines": [
      "Alerts are typically triggered when there are group membership changes involving the honeytoken or the group it resides in.",
      "Some common causes include:",
      "· Expected administrative activity",
      "· Service accounts making automated changes",
      "· Normal changes to the group that contains the honeytoken accoun",
      "Best practices:",
      "1. Review which account made the group membership change.",
      "2. Confirm whether that account is a service account or an administrator performing expected activity.",
      "3. Validate whether the change aligns with your organization’s intended configuration.",
      "If the activity is legitimate, no further action is required. If not, then it may warrant deeper investigation on your side."
    ],
    "submittedBy": "Austine",
    "timestamp": "2025-09-04T18:50:43.246Z",
    "kbText": "Alerts are typically triggered when there are group membership changes involving the honeytoken or the group it resides in.\nSome common causes include:\n· Expected administrative activity\n· Service accounts making automated changes\n· Normal changes to the group that contains the honeytoken accoun\nBest practices:\n1. Review which account made the group membership change.\n2. Confirm whether that account is a service account or an administrator performing expected activity.\n3. Validate whether the change aligns with your organization’s intended configuration.\nIf the activity is legitimate, no further action is required. If not, then it may warrant deeper investigation on your side."
  }
]